# Реалізація множення байта на 2 в полі Галуа
def mul02(byte):
    result = byte << 1  # зсув вліво на 1 біт
    if result & 0x100:  # якщо результат більший за 8 біт (перший біт 1), необхідно застосувати модульний поліном
        result ^= 0x1b  # застосування полінома m(x) = 0001 1011
    result &= 0xff  # обмеження результату до 8 біт
    return result


# Реалізація множення байта на 3 в полі Галуа
def mul03(byte):
    return mul02(byte) ^ byte  # dx * 03 == dx * 02 + dx


# Тестування на наведених прикладах
def test():
    byte1 = 0xD4
    byte2 = 0xBF
    result1 = mul02(byte1)
    result2 = mul03(byte2)
    print(f"D4 * 02 = {result1:02X}")  # Очікуваний результат B3
    print(f"BF * 03 = {result2:02X}")  # Очікуваний результат DA


# Виклик функції тестування
test()